//Показать треугольник Паскаля.
//Прказать его в прямоугольной форме.
//1
//1 1
//1 2 1
//1 3 3 1
//1 4 6 4 1

//Показать его в равнобедренной форме (хотя бы 20 строк).
//(a+b)^2 = 
//    1                                    
//   1 1                                    
//  1 2 1                                    
// 1 3 3 1                                    
//1 4 6 4 1      

//Показать разложение многочлена m-ой степени при помощи треугольника.

//Показать треугольник Паскаля в виде:
//    *                                    
//   * *                                    
//  *   *                                    
// * * * *                                    
//*       *
//НО показывайте "*" только если соответствующий коэф. треугольника нечетный. Хотя бы для 100 строк.

